/*Задача 11.
Напишете програма, която умножава 2 числа, като
използва пойнтер-и.
Пойнтер-ите не са страшни. Дефинират се като
тип *Х и се използват като *Х. Както променливите,
но със * отпред (и 1 наум!).
Продължение: Опитайте да умножите 2 променливи от
различен тип, използвайки пойнтери.*/
#include <stdio.h>

int main(){
  int a,b;
  int *ptr =&a;
  int *ptr2=&b;
  *ptr = 5;
  *ptr2=5;
  printf("%d\n",(*ptr)*(*ptr2));
  int c = 5;
  char d = 6;
  char *f;
  ptr = &c;
  f = &d;
  printf("%d\n",(*ptr)*(*f));
  return 0;
}