/*Задача 9. Дефинирайте и инициализирайте променлива „а“.
Пойнтер към пойнтер към променлива.
Дефинирайте и инициализирайте пойнтер към нея.
Дефинирайте и инициализирайте пойнтер към първия пойнтер. Задайте
стойност на втория пойнтер 15.
Колко е стойността на променливата „а“?*/
#include <stdio.h>

int main(){
  char a = 'a';
  char *p = &a;
  char **pp = &p;
  **pp=15;

  printf("%u\n",&a);
  printf("%u\n",p);
  printf("%u\n",pp);
  printf("%d\n",a);
}