/*Задача 4.
Дефинирайте пойнтер и опитайте да отпечатате стойността
му на конзолата (%р) с printf.
Какво се визуализира?*/
#include <stdio.h>

int main(){
  int a = 5;
int *ptr = &a;
printf("%p",ptr);
return 0;
}